// Задача №17. Напишите программу, которая принимает на вход координаты точки (X и Y), 
// причем X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка.

Console.WriteLine("Введите координаты Х:");
int x = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Введите координаты Y:");
int y = Convert.ToInt32(Console.ReadLine());
if (x > 0 && y > 0)
{
Console.WriteLine("Точки находятся в первой координатной четверти: ");
}
else if (x < 0 && y > 0)
{
Console.WriteLine("Точки находятся во второй координатной четверти: ");
}
else if (x < 0 && y < 0)
{
Console.WriteLine("Точки находятся в третьей координатной четверти: ");
}
else if (x > 0 && y < 0)
{
Console.WriteLine("Точки находятся в четвёртой координатной четверти: ");
}
else
{
Console.WriteLine("Не возможно определить координатную четверть.");
}
